package manyo

import (
	"strings"
)

type Element struct {
	Kana      string
	KanjiList []string
}

var manyoKunlist = []Element{
	Element{"しし", []string{"十六"}},
	Element{"くく", []string{"八十一"}},
	Element{"ささ", []string{"神楽声"}},
	Element{"かり", []string{"切木四"}},
	Element{"もちづき", []string{"三五月"}},
	Element{"つく", []string{"三伏一向"}},
	Element{"ころ", []string{"一伏三向"}},
	Element{"いぶ", []string{"馬聲蜂音"}},
}

var manyolist = []Element{
	Element{"あ", []string{"阿", "安", "英", "足", "嗚呼"}},
	Element{"か", []string{"可", "何", "加", "架", "香", "蚊", "迦"}},
	Element{"さ", []string{"左", "佐", "沙", "作", "者", "柴", "紗", "草", "散"}},
	Element{"た", []string{"太", "多", "他", "丹", "駄", "田", "手", "立"}},
	Element{"な", []string{"那", "男", "奈", "南", "寧", "難", "七", "名", "魚", "菜"}},
	Element{"は", []string{"八", "方", "芳", "房", "半", "伴", "倍", "泊", "波", "婆", "破", "薄", "播", "幡", "羽", "早", "者", "速", "葉", "歯"}},
	Element{"ま", []string{"万", "末", "馬", "麻", "摩", "磨", "満", "前", "真", "間", "鬼"}},
	Element{"や", []string{"也", "移", "夜", "楊", "耶", "野", "八", "矢", "屋"}},
	Element{"ら", []string{"良", "浪", "郎", "楽", "羅", "等"}},
	Element{"わ", []string{"和", "丸", "輪"}},
	Element{"が", []string{"我", "何", "賀"}},
	Element{"ざ", []string{"社", "射", "謝", "耶", "奢", "装", "蔵"}},
	Element{"だ", []string{"陀", "太", "大", "嚢"}},
	Element{"ば", []string{"伐", "婆", "磨", "魔"}},
	Element{"う", []string{"宇", "羽", "于", "有", "卯", "烏", "得"}},
	Element{"く", []string{"久", "九", "口", "丘", "苦", "鳩", "来"}},
	Element{"す", []string{"寸", "須", "周", "酒", "州", "洲", "珠", "数", "酢", "栖", "渚"}},
	Element{"つ", []string{"都", "豆", "通", "追", "川", "津"}},
	Element{"ぬ", []string{"奴", "努", "怒", "農", "濃", "沼", "宿"}},
	Element{"ふ", []string{"不", "否", "布", "負", "部", "敷", "経", "歴"}},
	Element{"む", []string{"牟", "武", "無", "模", "務", "謀", "六"}},
	Element{"ゆ", []string{"由", "喩", "遊", "湯"}},
	Element{"る", []string{"留", "流", "類"}},
	Element{"ぐ", []string{"具", "遇", "隅", "求", "愚", "虞"}},
	Element{"ず", []string{"受", "授", "殊", "儒"}},
	Element{"づ", []string{"豆", "頭", "弩"}},
	Element{"ぶ", []string{"夫", "扶", "府", "文", "柔", "歩", "部"}},
	Element{"い", []string{"伊", "怡", "以", "異", "已", "移", "射", "五", "五十"}},
	Element{"き", []string{"支", "伎", "岐", "企", "棄", "寸", "吉", "杵", "來", "貴", "紀", "記", "奇", "寄", "忌", "幾", "木", "城"}},
	Element{"し", []string{"子", "之", "芝", "水", "四", "司", "詞", "斯", "志", "思", "信", "偲", "寺", "侍", "時", "歌", "詩", "師", "紫", "新", "旨", "指", "次", "此", "死", "事", "准", "磯", "為", "二二"}},
	Element{"ち", []string{"知", "智", "陳", "千", "乳", "血", "茅"}},
	Element{"に", []string{"二", "人", "日", "仁", "爾", "迩", "尼", "耳", "柔", "丹", "荷", "似", "煮", "煎"}},
	Element{"ひ", []string{"比", "必", "卑", "賓", "日", "氷", "飯", "負", "嬪", "臂", "避", "匱", "非", "悲", "斐", "火", "肥", "飛", "樋", "干", "乾", "彼", "被", "秘"}},
	Element{"み", []string{"民", "彌", "美", "三", "水", "見", "視", "御", "未", "味", "尾", "微", "身", "実", "箕"}},
	Element{"り", []string{"里", "理", "利", "梨", "隣", "入", "煎"}},
	Element{"うぃ", []string{"位", "為", "謂", "井", "猪", "藍"}},
	Element{"ぎ", []string{"伎", "祇", "芸", "岐", "儀", "蟻", "疑", "宜", "義", "擬"}},
	Element{"じ", []string{"自", "士", "仕", "司", "時", "尽", "慈", "耳", "餌", "児", "弐", "爾"}},
	Element{"ぢ", []string{"遅", "治", "地", "恥", "尼", "泥"}},
	Element{"び", []string{"婢", "鼻", "弥", "備", "肥", "飛", "乾", "眉", "媚"}},
	Element{"え", []string{"衣", "依", "愛", "榎", "可愛"}},
	Element{"け", []string{"祁", "家", "計", "係", "價", "結", "鶏", "気", "既", "毛", "飼", "消"}},
	Element{"せ", []string{"世", "西", "斉", "勢", "施", "背", "脊", "迫", "瀬", "石花"}},
	Element{"て", []string{"堤", "天", "帝", "底", "手", "代", "直"}},
	Element{"ね", []string{"禰", "尼", "泥", "年", "根", "宿"}},
	Element{"へ", []string{"平", "反", "返", "弁", "弊", "陛", "遍", "覇", "部", "辺", "重", "隔", "閉", "倍", "陪", "拝", "戸", "経"}},
	Element{"め", []string{"売", "馬", "面", "女", "梅", "米", "迷", "昧", "目", "眼", "海"}},
	Element{"いぇ", []string{"曳", "延", "要", "遥", "叡", "兄", "江", "吉", "枝"}},
	Element{"れ", []string{"礼", "列", "例", "烈", "連"}},
	Element{"うぇ", []string{"廻", "恵", "面", "咲"}},
	Element{"げ", []string{"下", "牙", "雅", "夏", "義", "気", "宜", "礙", "削"}},
	Element{"ぜ", []string{"是", "湍"}},
	Element{"で", []string{"代", "田", "泥", "庭", "伝", "殿", "而", "涅", "提", "弟"}},
	Element{"べ", []string{"弁", "便", "別", "部", "倍", "毎"}},
	Element{"お", []string{"意", "憶", "於", "應"}},
	Element{"こ", []string{"古", "姑", "枯", "故", "侯", "孤", "児", "粉", "己", "巨", "去", "居", "忌", "許", "虚", "興", "木"}},
	Element{"そ", []string{"宗", "祖", "素", "蘇", "十", "所", "則", "曾", "僧", "増", "憎", "衣", "背", "苑"}},
	Element{"と", []string{"刀", "土", "斗", "度", "戸", "利", "速", "止", "等", "登", "澄", "得", "騰", "十", "鳥", "常", "跡"}},
	Element{"の", []string{"努", "怒", "野", "乃", "能", "笑", "荷"}},
	Element{"ほ", []string{"凡", "方", "抱", "朋", "倍", "保", "宝", "富", "百", "帆", "穂"}},
	Element{"も", []string{"毛", "畝", "蒙", "木", "問", "聞", "方", "面", "忘", "母", "文", "茂", "記", "勿", "物", "望", "門", "喪", "裳", "藻"}},
	Element{"よ", []string{"用", "容", "欲", "夜", "与", "余", "四", "世", "代", "吉"}},
	Element{"ろ", []string{"路", "漏", "呂", "侶"}},
	Element{"を", []string{"乎", "呼", "遠", "鳥", "怨", "越", "少", "小", "尾", "麻", "男", "緒", "雄"}},
	Element{"ご", []string{"吾", "呉", "胡", "娯", "後", "籠", "児", "悟", "誤", "其", "期", "碁", "語", "御", "馭", "凝"}},
	Element{"ぞ", []string{"俗", "序", "叙", "賊", "存", "茹", "鋤"}},
	Element{"ど", []string{"土", "度", "渡", "奴", "怒", "特", "藤", "騰", "等", "耐", "抒", "杼"}},
	Element{"ぼ", []string{"煩", "菩", "番", "蕃"}},
	Element{"しな", []string{"信"}},
	Element{"らむ", []string{"覧"}},
	Element{"さが", []string{"相"}},
	Element{"あり", []string{"蟻"}},
	Element{"まく", []string{"巻"}},
	Element{"かも", []string{"鴨"}},
	Element{"いかり", []string{"慍"}},
	Element{"おろし", []string{"下"}},
	Element{"かしき", []string{"炊"}},
}

// ConvertManyoToKana 万葉仮名から仮名に変換する
func ConvertManyoToKana(s string) string {
	var result = s
	for _, e := range manyoKunlist {
		for _, c := range e.KanjiList {
			if strings.Index(result, c) != -1 {
				result = strings.ReplaceAll(result, c, e.Kana)
			}
		}
	}

	for _, e := range manyolist {
		for _, c := range e.KanjiList {
			if strings.Index(result, c) != -1 {
				result = strings.ReplaceAll(result, c, e.Kana)
			}
		}
	}
	return result
}
